export const DELIVERY_TYPES = ['Самовывоз', 'Доставка (СДЭК)']
export const PAYMENT_METHODS = ['Онлайн-оплата', 'Оплата по счету', 'При получении']
export const DELIVERY_STATUSES = ['Сборка', 'Передан в службу доставки', 'В пути', 'Доставлен', 'Готов к выдаче']
export const ONLINE_PAYMENT_STATUSES = ['Не оплачен', 'В обработке', 'Отклонен', 'Счет выставлен', 'Оплачен']
export const ORDER_STATUSES = ['Новый', 'В обработке', 'Подтвержден', 'Ожидает оплаты', 'Доставляется', 'Готов к выдаче', 'Нет в наличии', 'Выполнен', 'Отменен', 'Оплачен']
export const REQUEST_TYPES = ['Новая', 'В обработке', 'Закрыта', 'Спам'];
export const REQUEST_TYPE = ['Заявка на пошив', 'Уведомить о поступлении'];
