import {QuestionCircleOutlined} from "@ant-design/icons";
import s from './Delete.module.scss';
import {Popconfirm} from "antd";
import {clsx} from "clsx";

interface DeleteProps{
    description: string
    onConfirm: () => void
    className?: string
}
export default function Delete({onConfirm, description, className}: DeleteProps){
    return(
        <Popconfirm
            title="Подтвердите действие"
            description={description}
            onConfirm={onConfirm}
            okText="Да"
            cancelText="Отмена"
            icon={<QuestionCircleOutlined style={{color: 'red'}}/>}
        >
            <svg className={clsx(s.icon, className)} xmlns="http://www.w3.org/2000/svg" width="22" height="22"
                 viewBox="0 0 22 22" fill="none">
                <g clipPath="url(#clip0_445_1491)">
                    <path
                        d="M19.3124 18H7.06244C7.00251 18 6.94322 17.9876 6.88828 17.9637C6.83333 17.9397 6.7839 17.9047 6.74306 17.8609L0.618064 11.2984C0.542281 11.2173 0.500122 11.1105 0.500122 10.9996C0.500122 10.8886 0.542281 10.7818 0.618064 10.7007L6.74306 4.13825C6.78404 4.09462 6.83352 4.05985 6.88844 4.03607C6.94337 4.0123 7.00259 4.00002 7.06244 4H19.3124C20.5191 4 21.4999 4.98175 21.4999 6.1875V15.8125C21.4999 17.0183 20.5191 18 19.3124 18ZM7.25231 17.125H19.3124C20.0361 17.125 20.6249 16.5361 20.6249 15.8125V6.1875C20.6249 5.46387 20.0361 4.875 19.3124 4.875H7.25231L1.53594 11L7.25231 17.125Z"
                        fill="currentColor"/>
                    <path
                        d="M17.1249 14.5C17.0089 14.5001 16.8975 14.4541 16.8152 14.3723L10.6902 8.2473C10.6105 8.16478 10.5664 8.05427 10.5674 7.93956C10.5684 7.82485 10.6144 7.71512 10.6955 7.634C10.7766 7.55288 10.8864 7.50687 11.0011 7.50588C11.1158 7.50488 11.2263 7.54898 11.3088 7.62867L17.4338 13.7537C17.4948 13.8149 17.5363 13.8927 17.5531 13.9775C17.5699 14.0622 17.5613 14.15 17.5282 14.2298C17.4952 14.3097 17.4393 14.3779 17.3675 14.426C17.2957 14.4741 17.2113 14.4999 17.1249 14.5Z"
                        fill="currentColor"/>
                    <path
                        d="M10.9999 14.5C10.9134 14.5 10.8289 14.4744 10.757 14.4264C10.6851 14.3784 10.6291 14.3101 10.5959 14.2302C10.5628 14.1504 10.554 14.0625 10.5708 13.9777C10.5876 13.8929 10.6291 13.8149 10.6902 13.7537L16.8152 7.62867C16.8977 7.54898 17.0082 7.50488 17.1229 7.50588C17.2376 7.50687 17.3473 7.55288 17.4285 7.634C17.5096 7.71512 17.5556 7.82485 17.5566 7.93956C17.5576 8.05427 17.5135 8.16478 17.4338 8.2473L11.3088 14.3723C11.2682 14.4129 11.2201 14.445 11.1671 14.467C11.1141 14.4889 11.0573 14.5001 10.9999 14.5Z"
                        fill="currentColor"/>
                </g>
                <defs>
                    <clipPath id="clip0_445_1491">
                        <rect width="21" height="21" fill="white" transform="translate(0.5 0.5)"/>
                    </clipPath>
                </defs>
            </svg>
        </Popconfirm>
    )
}
